---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IFCExportOptions Constructor
IFCExportOptions Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | IFCExportOptions()()()() | Default constructor. Initializes FileVersion to Default. WallAndColumnSplitting and ExportBaseQuantities are set to false. FamilyMappingFile is set to empty. |
|  | IFCExportOptions(IFCExportOptions) | Creates a copy of an IFCExportOptions. |

# See Also

IFCExportOptions Class

IFCExportOptions Members

Autodesk.Revit.DB Namespace